; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v1 - type_2)
 	      (pred_4 ?v2 - object ?v1 - type_2)
	      (pred_1 ?v5 - type_1 ?v7 - type_3)
	      (pred_2 ?v5 - type_1 ?v2 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v6 ?v4 - type_2)
       :precondition (and  (pred_3 ?v5 ?v6))
       :effect (and  (pred_3 ?v5 ?v4)
		     (not (pred_3 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_1 ?v8 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v3) (pred_3 ?v5 ?v3) (pred_1 ?v5 ?v7))
       :effect (and (pred_2 ?v5 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v3)) 
		    (not (pred_1 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_1 ?v8 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v8 ?v7) (pred_3 ?v5 ?v3))
       :effect (and (pred_4 ?v8 ?v3)
		    (pred_1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v8 ?v7)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_01 obj_02 - type_1
obj_10 obj_05 obj_11 obj_07 - type_3
obj_08 obj_04 obj_03 - type_2
obj_06 obj_09 - object)
(:init
(pred_3 obj_01 obj_04)
(pred_1 obj_01 obj_10)
(pred_1 obj_01 obj_05)
(pred_3 obj_02 obj_08)
(pred_1 obj_02 obj_11)
(pred_1 obj_02 obj_07)
(pred_4 obj_06 obj_08)
(pred_4 obj_09 obj_08)
)
(:goal
(and
(pred_4 obj_06 obj_04)
(pred_4 obj_09 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_01 obj_04) (pred_3 obj_02 obj_04))))
  )
)
)

; plan
1. (op_2 obj_02 obj_06 obj_08 obj_07)
   deleted: (pred_4 obj_06 obj_08) (pred_1 obj_02 obj_07)
   added: (pred_2 obj_02 obj_06 obj_07)
   goals met: 1 of 2
2. (op_3 obj_01 obj_04 obj_08)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_08)
   goals met: 1 of 2
3. (op_3 obj_02 obj_08 obj_04)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_04)
   goals met: 1 of 2
4. (op_1 obj_02 obj_06 obj_04 obj_07)
   deleted: (pred_2 obj_02 obj_06 obj_07)
   added: (pred_4 obj_06 obj_04) (pred_1 obj_02 obj_07)
   goals met: 2 of 2
